Autodesk.Navisworks.Api.Progress.BeginSubOperation(System.Double,System.String)
Starts a sub operation. Progress in sub op between 0 and 1 maps to fraction of remaining time in main operation. Can be nested.
fractionOfRemainingTime: Fraction of remaining time this sub operation will take, between 0 and 1
message: User message to display for this sub operation.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentOutOfRangeException:
Argument 'fractionOfRemainingTime' is outside the range 0 to 1

Autodesk.Navisworks.Api.Progress.Update(System.Double)
Updates progress on the current operation or sub-operation
fractionDone: Fraction of operation or sub-operation completed, between 0 and 1
Returns: false if user wants to cancel operation, true if they want to continue.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentOutOfRangeException:
Argument 'fractionDone' is outside the range 0 to 1